#include <iostream>
#include <Windows.h>
#include <locale>
#include <cmath>
using namespace std;

// Ввести врожайність трьох сортів пшениці (36, 40, 44 т/га) і площі трьох відповідних полів (га).
// Скільки зібрали пшениці з кожного поля і з трьох полів разом?
void first()
{  
    cout << "1.1 задача\n";
    int x1, x2, x3;
    cout << "Введіть площу першого, другого та третього полів:\n";
    cin >> x1 >> x2 >> x3;
    cout << "З першого поля зібрали " << x1 * 36 << " тонн пшениці\n";
    cout << "З другого поля зібрали " << x2 * 40 << " тонн пшениці\n";
    cout << "З третього поля зібрали " << x3 * 44 << " тонн пшениці\n";
    cout << "Загальний врожай з усіх трьох полів = " << x1 * 36 + x2 * 40 + x3 * 44 << endl;
}

// Написати програму, яка за показниками лічильника в два різні моменти часу
// визначає вартість витраченої електроенергії за відповідний проміжок часу.
void second()
{
    cout << "1.2 задача\n";
    int x, y, z;
    cout << "Введіть показники лічилька на початку, в кінці та вартість електроенергії:\n";
    cin >> x >> y >> z;
    cout << "Вартість за вказаний проміжок часу становить: " << (y - x) * z << "грн\n";
}

void third()
{
    cout << "2 задача\n";
    // Трикутник задано координатами вершин 𝐴(0;0),𝐵(4;3),𝐶(−4;5).
    // Відразу обрахуємо відстань між координатами. Нижче вставляємо значення сторін трикутника.
    double a = 8;
    double b = 6;
    double c = 5;
    double p = (a + b + c) / 2;
    double s = sqrt(p * (p - a) * (p - b) * (p - c));
    double ha = (2 * s) / a;
    double mb = 0.5 * (sqrt(2 * a * a + 2 * c * c - b * b));
    cout << "Висота = " << ha << "; медіана = " << mb;
}

// Написати програму, яка обчислює вирази за двома формулами.
// Попередньо підготуйте тестові приклади для другої формули з допомогою калькулятора
// (результати обчислення за двома формулами мають співпадати).
void four()
{
    cout << "\n3 задача\n";
    cout << "Для порівняння двух функцій введіть цифру 1 для продовження:";
    double a;
    cin >> a;
    double z1 = (sin(2 * a) + sin(5 * a) - sin(3 * a)) / (cos(a) - cos(3 * a) + cos(5 * a));
    double z2 = tan(3 * a);
    cout << z1 << "\n";
    cout << z2 << "\n";
    cout << "Функції не рівні" << "\n";
}

void five()
{
    cout << "\n4 задача\n";
    // Скласти структурну схему алгоритму та програму обчислення значень функції y=F(x) відповідно до завдань, зазначених у таблиці.
    // Примітка. Значення першого з двох параметрів, які наведені в таблиці, задати як константу, значення другого ввести з клавіатури.
    double x = 1.7;
    double a, b, y, t;
    cout << "Введіть значення t:\n";
    cin >> t;
    a = log10(x);
    b = sqrt(pow(x, 2) + pow(t, 2));
    y = pow(fabs(a - b), 1.0 / 3.0);
    cout << y << endl;
}

void sixth()
{
    cout << "\n5 задача\n";
    // Використовуючи відповідні компоненти створити додаток для розв’язування наступної задачі:
    // знайти значення виразу врахувавши область визначення.
    double x, y, h, f;
    wcout << "x: ";
    cin >> x;
    wcout << "y: ";
    cin >> y;
    wcout << "h: ";
    cin >> h;
    f = sqrt((1 - 2 * pow(cos(x), 2)) / (sin(h) - cos(y)));
    cout << "Значення виразу дорівнює: " << f << "\n";
    if (isnan(f) || isinf(f))
    {
        cout << "Корінь можно знайти тільки додатнього числа або нуля\n";
    }

}

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    setlocale(LC_ALL, ".1251");
    first();
    second();
    third();
    four();
    five();
    sixth();
    return 0;
}